In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame(np.arange(0,20).reshape(4,5),index=["R1","R2","R3","R4"],columns=["Col1","Col2","Col3","Col4","Col5"])
df

    Col1  Col2  Col3  Col4  Col5
R1     0     1     2     3     4
R2     5     6     7     8     9
R3    10    11    12    13    14
R4    15    16    17    18    19

In [4]:
#saving the output in csv file
df.to_csv("test.csv")

In [5]:
#accessing the data from dataframe using loc=lable based access
df.loc["R1"]

Col1    0
Col2    1
Col3    2
Col4    3
Col5    4
Name: R1, dtype: int32

In [6]:
type(df.loc["R1"])

pandas.core.series.Series

In [19]:
#index position based accessing
df.iloc[0,:]

Col1    0
Col2    1
Col3    2
Col4    3
Col5    4
Name: R1, dtype: int32

In [20]:
type(df.iloc[0,:])

pandas.core.series.Series

In [25]:
#convert dataframes into array
df.iloc[:,:].values

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [28]:
#check null values in DF
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
Col5    0
dtype: int64

In [31]:
#check number of occurances in col
df.value_counts("Col1")

Col1
0     1
5     1
10    1
15    1
dtype: int64

In [34]:
#check unique values
df["Col1"].unique()

array([ 0,  5, 10, 15])

In [35]:
df['Col1']

R1     0
R2     5
R3    10
R4    15
Name: Col1, dtype: int32

In [37]:
#reading data from csv
data=pd.read_csv("test.csv")
data.head()

  Unnamed: 0  Col1  Col2  Col3  Col4  Col5
0         R1     0     1     2     3     4
1         R2     5     6     7     8     9
2         R3    10    11    12    13    14
3         R4    15    16    17    18    19

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   Col1        4 non-null      int64
 2   Col2        4 non-null      int64
 3   Col3        4 non-null      int64
 4   Col4        4 non-null      int64
 5   Col5        4 non-null      int64
dtypes: int64(5), object(1)
memory usage: 320.0+ bytes

In [40]:
data.describe()

            Col1       Col2       Col3       Col4       Col5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [52]:
from io import StringIO,BytesIO

SyntaxError: invalid syntax (<ipython-input-52-b9d0aa569a2c>, line 1)

In [41]:
data1=('c1,c2,c3\n'
          '1,2,3\n'
          '4,5,6\n'
          '7,8,9')

In [49]:
type(data1)

str

In [53]:
StringIO()

In [51]:
data2=pd.read_csv(StringIO(data1))
data2

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9

In [65]:
data3=pd.read_csv(StringIO(data1),usecols=["c1","c3"],dtype=object)
data3

  c1 c3
0  1  3
1  4  6
2  7  9

In [66]:
type(data3)

pandas.core.frame.DataFrame

In [70]:
data3["c1"][1]

'4'

In [68]:
type(data3["c1"][1])

str

In [72]:
data4=pd.read_csv(StringIO(data1),dtype={"c1":int,"c3":float})
data4

   c1  c2   c3
0   1   2  3.0
1   4   5  6.0
2   7   8  9.0

In [74]:
type(data4["c3"][1])

numpy.float64

In [76]:
data5=pd.read_csv(StringIO(data1),index_col=2)
data5

    c1  c2
c3
3    1   2
6    4   5
9    7   8

In [82]:
data6=('c1,c2,c3\n'
          '1,rocky,sdsd,\n'
          '4,ddd,ffff,\n'
          '7,bbbb,kkk,')

In [87]:
data7=pd.read_csv(StringIO(data6),index_col=False)
data7

   c1     c2    c3
0   1  rocky  sdsd
1   4    ddd  ffff
2   7   bbbb   kkk

# reading json

In [116]:
data8='{"myself":[{"name":"rocky","age":27,"hobbies":[{"title1":"youtube","title2":"cricket"}]},{"name":"rocky","age":27,"hobbies":[{"title1":"youtube","title2":"cricket"}]}]}'
df8=pd.read_json(data8)
df8

                                              myself
0  {'name': 'rocky', 'age': 27, 'hobbies': [{'tit...
1  {'name': 'rocky', 'age': 27, 'hobbies': [{'tit...

In [117]:
df8.to_json(orient="records")

'[{"myself":{"name":"rocky","age":27,"hobbies":[{"title1":"youtube","title2":"cricket"}]}},{"myself":{"name":"rocky","age":27,"hobbies":[{"title1":"youtube","title2":"cricket"}]}}]'

In [118]:
type(df8.to_json())

str

# reading html

In [128]:
url="https://en.wikipedia.org/wiki/Mobile_country_code"
mobile_code=pd.read_html(url,match="Operator",header=0)
mobile_code[0]

,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
0,1,1,TEST,Test network,Operational,any,NaN
1,1,1,TEST,Test network,Operational,any,NaN
2,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"
3,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"

# reading excel nad pickling

In [132]:
path="Sample - Superstore.xls"
excel=pd.read_excel(path)
excel.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country/Region,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2019-138688,2019-06-12,2019-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2018-108966,2018-10-11,2018-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2018-108966,2018-10-11,2018-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [133]:
excel.to_pickle("excel")

In [135]:
pickle=pd.read_pickle("excel")
pickle.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country/Region,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2019-138688,2019-06-12,2019-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2018-108966,2018-10-11,2018-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2018-108966,2018-10-11,2018-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164